Debug Output:-

Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloudbuild_trigger.testing will be created
  + resource "google_cloudbuild_trigger" "testing" {
      + create_time = (known after apply)
      + description = "testing environment."
      + filename    = "cloudbuild.yaml"
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = "testing"
      + trigger_id  = (known after apply)

      + github {
          + name  = "repo-name"
          + owner = "organization_name"

          + push {
              + branch = "test"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
